In [1]:
import findspark

In [2]:
findspark.init()

In [3]:
from pyspark.sql import SparkSession

#create a spark session
spark=SparkSession.builder.appName("RDDExample").getOrCreate()

Setting default log level to "WARN".
To adjust logging level use sc.setLogLevel(newLevel). For SparkR, use setLogLevel(newLevel).
23/09/21 08:35:56 WARN NativeCodeLoader: Unable to load native-hadoop library for your platform... using builtin-java classes where applicable
23/09/21 08:35:58 WARN Utils: Service 'SparkUI' could not bind on port 4040. Attempting port 4041.

In [6]:
# creating dataframe
df = spark.createDataFrame([(10,7,3)])

In [7]:
df.show()

+---+---+---+
| _1| _2| _3|
+---+---+---+
| 10|  7|  3|
+---+---+---+

In [8]:
from datetime import datetime, date
import pandas as pd
from pyspark.sql import Row

df = spark.createDataFrame([
    Row(a=1, b=2., c='string1', d=date(2000, 1, 1), e=datetime(2000, 1, 1, 12, 0)),
    Row(a=2, b=3., c='string2', d=date(2000, 2, 1), e=datetime(2000, 1, 2, 12, 0)),
    Row(a=4, b=5., c='string3', d=date(2000, 3, 1), e=datetime(2000, 1, 3, 12, 0))
])
df

DataFrame[a: bigint, b: double, c: string, d: date, e: timestamp]

In [9]:
df.show()

+---+---+-------+----------+-------------------+
|  a|  b|      c|         d|                  e|
+---+---+-------+----------+-------------------+
|  1|2.0|string1|2000-01-01|2000-01-01 12:00:00|
|  2|3.0|string2|2000-02-01|2000-01-02 12:00:00|
|  4|5.0|string3|2000-03-01|2000-01-03 12:00:00|
+---+---+-------+----------+-------------------+

In [11]:
schema='a long, b double, c string, d date, e timestamp'

In [13]:
data = [
    (1, 2., 'string1', date(2000, 1, 1), datetime(2000, 1, 1, 12, 0)),
    (2, 3., 'string2', date(2000, 2, 1), datetime(2000, 1, 2, 12, 0)),
    (3, 4., 'string3', date(2000, 3, 1), datetime(2000, 1, 3, 12, 0))    
]

In [18]:
df1 = spark.createDataFrame(data,schema)
# it will need two paramaner data and schema(optional)(if we do not specify it, it will take it the default one) there are more parameters as well in createDataframe

In [19]:
df.show()

+---+---+-------+----------+-------------------+
|  a|  b|      c|         d|                  e|
+---+---+-------+----------+-------------------+
|  1|2.0|string1|2000-01-01|2000-01-01 12:00:00|
|  2|3.0|string2|2000-02-01|2000-01-02 12:00:00|
|  4|5.0|string3|2000-03-01|2000-01-03 12:00:00|
+---+---+-------+----------+-------------------+

In [20]:
data1 = [(1,'a','z',990067,'India'),(2,'b','y',880056,'Turkey')]

In [26]:
# create schema
#3ways: 
# list, string,pyspark sql
# 1. string type way
schema2 = "id int,name string,l_name string,no int,country string"
#2. list 
schema_list = ['id','name','l_name','no','country']

In [27]:
df3 = spark.createDataFrame(data1,schema2)

In [28]:
df3.show()

+---+----+------+------+-------+
| id|name|l_name|    no|country|
+---+----+------+------+-------+
|  1|   a|     z|990067|  India|
|  2|   b|     y|880056| Turkey|
+---+----+------+------+-------+

In [29]:
df3.dtypes

[('id', 'int'),
 ('name', 'string'),
 ('l_name', 'string'),
 ('no', 'int'),
 ('country', 'string')]

In [32]:
df4 = spark.createDataFrame(data1,schema_list)
df4.show()

+---+----+------+------+-------+
| id|name|l_name|    no|country|
+---+----+------+------+-------+
|  1|   a|     z|990067|  India|
|  2|   b|     y|880056| Turkey|
+---+----+------+------+-------+

In [31]:
df4.printSchema()

root
 |-- id: long (nullable = true)
 |-- name: string (nullable = true)
 |-- l_name: string (nullable = true)
 |-- no: long (nullable = true)
 |-- country: string (nullable = true)

In [34]:
# json sample data
users = [{
    "id":1,
    "f_name":"a",
    "amount_paid":5000
},
{
    "id":2,
    "f_name":"b",
    "amount_paid":6000
}]
df5 = spark.createDataFrame(users)
df5.show()

+-----------+------+---+
|amount_paid|f_name| id|
+-----------+------+---+
|       5000|     a|  1|
|       6000|     b|  2|
+-----------+------+---+

In [58]:
ndf = spark.read.csv('/home/labuser/day3/employees.csv')

In [59]:
ndf.show()

+----------+------+----------+---------------+------+-------+-----------------+--------------------+
|       _c0|   _c1|       _c2|            _c3|   _c4|    _c5|              _c6|                 _c7|
+----------+------+----------+---------------+------+-------+-----------------+--------------------+
|First Name|Gender|Start Date|Last Login Time|Salary|Bonus %|Senior Management|                Team|
|   Douglas|  Male|  8/6/1993|       12:42 PM| 97308|  6.945|             true|           Marketing|
|    Thomas|  Male| 3/31/1996|        6:53 AM| 61933|   4.17|             true|                null|
|     Maria|Female| 4/23/1993|       11:17 AM|130590| 11.858|            false|             Finance|
|     Jerry|  Male|  3/4/2005|        1:00 PM|138705|   9.34|             true|             Finance|
|     Larry|  Male| 1/24/1998|        4:47 PM|101004|  1.389|             true|     Client Services|
|    Dennis|  Male| 4/18/1987|        1:35 AM|115163| 10.125|            false|               Legal|
|      Ruby|Female| 8/17/1987|        4:20 PM| 65476| 10.012|             true|             Product|
|      null|Female| 7/20/2015|       10:43 AM| 45906| 11.598|             null|             Finance|
|    Angela|Female|11/22/2005|        6:29 AM| 95570| 18.523|             true|         Engineering|
|   Frances|Female|  8/8/2002|        6:51 AM|139852|  7.524|             true|Business Development|
|    Louise|Female| 8/12/1980|        9:01 AM| 63241| 15.132|             true|                null|
|     Julie|Female|10/26/1997|        3:19 PM|102508| 12.637|             true|               Legal|
|   Brandon|  Male| 12/1/1980|        1:08 AM|112807| 17.492|             true|     Human Resources|
|      Gary|  Male| 1/27/2008|       11:40 PM|109831|  5.831|            false|               Sales|
|  Kimberly|Female| 1/14/1999|        7:13 AM| 41426| 14.543|             true|             Finance|
|   Lillian|Female|  6/5/2016|        6:09 AM| 59414|  1.256|            false|             Product|
|    Jeremy|  Male| 9/21/2010|        5:56 AM| 90370|  7.369|            false|     Human Resources|
|     Shawn|  Male| 12/7/1986|        7:45 PM|111737|  6.414|            false|             Product|
|     Diana|Female|10/23/1981|       10:27 AM|132940| 19.082|            false|     Client Services|
+----------+------+----------+---------------+------+-------+-----------------+--------------------+
only showing top 20 rows

In [60]:
ndf.printSchema()

root
 |-- _c0: string (nullable = true)
 |-- _c1: string (nullable = true)
 |-- _c2: string (nullable = true)
 |-- _c3: string (nullable = true)
 |-- _c4: string (nullable = true)
 |-- _c5: string (nullable = true)
 |-- _c6: string (nullable = true)
 |-- _c7: string (nullable = true)

In [61]:
df5=spark.read.option("header",True).option("inferschema",True).csv("/home/labuser/day3/employees.csv",header=True)

In [62]:
df5.printSchema()

root
 |-- First Name: string (nullable = true)
 |-- Gender: string (nullable = true)
 |-- Start Date: string (nullable = true)
 |-- Last Login Time: string (nullable = true)
 |-- Salary: integer (nullable = true)
 |-- Bonus %: double (nullable = true)
 |-- Senior Management: boolean (nullable = true)
 |-- Team: string (nullable = true)

In [69]:
#dataframe functions - to manipulate the dataframe
# -camel case
df5.select("First Name","Gender").show()
#Functions - 
# for normal functions we need to import them

+----------+------+
|First Name|Gender|
+----------+------+
|   Douglas|  Male|
|    Thomas|  Male|
|     Maria|Female|
|     Jerry|  Male|
|     Larry|  Male|
|    Dennis|  Male|
|      Ruby|Female|
|      null|Female|
|    Angela|Female|
|   Frances|Female|
|    Louise|Female|
|     Julie|Female|
|   Brandon|  Male|
|      Gary|  Male|
|  Kimberly|Female|
|   Lillian|Female|
|    Jeremy|  Male|
|     Shawn|  Male|
|     Diana|Female|
|     Donna|Female|
+----------+------+
only showing top 20 rows

In [70]:
df5.select("First Name".alias("forename"))
# to rename the column we tried using alias but it does not work

AttributeError: 'str' object has no attribute 'alias'

In [75]:
from pyspark.sql.functions import col
# we will now use col to rename it with alias
df5.select(col("First Name").alias("forename")).show()

+--------+
|forename|
+--------+
| Douglas|
|  Thomas|
|   Maria|
|   Jerry|
|   Larry|
|  Dennis|
|    Ruby|
|    null|
|  Angela|
| Frances|
|  Louise|
|   Julie|
| Brandon|
|    Gary|
|Kimberly|
| Lillian|
|  Jeremy|
|   Shawn|
|   Diana|
|   Donna|
+--------+
only showing top 20 rows

In [77]:
df5.select("First Name", col("Gender"),df5["Team"]).show()

+----------+------+--------------------+
|First Name|Gender|                Team|
+----------+------+--------------------+
|   Douglas|  Male|           Marketing|
|    Thomas|  Male|                null|
|     Maria|Female|             Finance|
|     Jerry|  Male|             Finance|
|     Larry|  Male|     Client Services|
|    Dennis|  Male|               Legal|
|      Ruby|Female|             Product|
|      null|Female|             Finance|
|    Angela|Female|         Engineering|
|   Frances|Female|Business Development|
|    Louise|Female|                null|
|     Julie|Female|               Legal|
|   Brandon|  Male|     Human Resources|
|      Gary|  Male|               Sales|
|  Kimberly|Female|             Finance|
|   Lillian|Female|             Product|
|    Jeremy|  Male|     Human Resources|
|     Shawn|  Male|             Product|
|     Diana|Female|     Client Services|
|     Donna|Female|             Product|
+----------+------+--------------------+
only showing top 20 rows

In [82]:
#change column names using withColumnRenamed
df5.withColumnRenamed('First Name', 'f_name').show()
#differnce between alias and withColumnRenamed:

# we can get the entire dataframe with withColumnRenamed but in alias we get two column ef first name and fname dono ayenge isme so 2 columns with same data i.e why we use withcolumnrenamed

+--------+------+----------+---------------+------+-------+-----------------+--------------------+
|  f_name|Gender|Start Date|Last Login Time|Salary|Bonus %|Senior Management|                Team|
+--------+------+----------+---------------+------+-------+-----------------+--------------------+
| Douglas|  Male|  8/6/1993|       12:42 PM| 97308|  6.945|             true|           Marketing|
|  Thomas|  Male| 3/31/1996|        6:53 AM| 61933|   4.17|             true|                null|
|   Maria|Female| 4/23/1993|       11:17 AM|130590| 11.858|            false|             Finance|
|   Jerry|  Male|  3/4/2005|        1:00 PM|138705|   9.34|             true|             Finance|
|   Larry|  Male| 1/24/1998|        4:47 PM|101004|  1.389|             true|     Client Services|
|  Dennis|  Male| 4/18/1987|        1:35 AM|115163| 10.125|            false|               Legal|
|    Ruby|Female| 8/17/1987|        4:20 PM| 65476| 10.012|             true|             Product|
|    null|Female| 7/20/2015|       10:43 AM| 45906| 11.598|             null|             Finance|
|  Angela|Female|11/22/2005|        6:29 AM| 95570| 18.523|             true|         Engineering|
| Frances|Female|  8/8/2002|        6:51 AM|139852|  7.524|             true|Business Development|
|  Louise|Female| 8/12/1980|        9:01 AM| 63241| 15.132|             true|                null|
|   Julie|Female|10/26/1997|        3:19 PM|102508| 12.637|             true|               Legal|
| Brandon|  Male| 12/1/1980|        1:08 AM|112807| 17.492|             true|     Human Resources|
|    Gary|  Male| 1/27/2008|       11:40 PM|109831|  5.831|            false|               Sales|
|Kimberly|Female| 1/14/1999|        7:13 AM| 41426| 14.543|             true|             Finance|
| Lillian|Female|  6/5/2016|        6:09 AM| 59414|  1.256|            false|             Product|
|  Jeremy|  Male| 9/21/2010|        5:56 AM| 90370|  7.369|            false|     Human Resources|
|   Shawn|  Male| 12/7/1986|        7:45 PM|111737|  6.414|            false|             Product|
|   Diana|Female|10/23/1981|       10:27 AM|132940| 19.082|            false|     Client Services|
|   Donna|Female| 7/22/2010|        3:48 AM| 81014|  1.894|            false|             Product|
+--------+------+----------+---------------+------+-------+-----------------+--------------------+
only showing top 20 rows

In [91]:
# combine two columns
# concat is not a dataframe function so we have to take a function uske andar we hav eto use concat i.e we can not directly do df.concat we have to use it inside functions 
from pyspark.sql.functions import *
df5.select(concat("Start Date",lit(" & "),"Last Login Time")).show()
# lit used to add space

+----------------------------------------+
|concat(Start Date,  & , Last Login Time)|
+----------------------------------------+
|                     8/6/1993 & 12:42 PM|
|                     3/31/1996 & 6:53 AM|
|                    4/23/1993 & 11:17 AM|
|                      3/4/2005 & 1:00 PM|
|                     1/24/1998 & 4:47 PM|
|                     4/18/1987 & 1:35 AM|
|                     8/17/1987 & 4:20 PM|
|                    7/20/2015 & 10:43 AM|
|                    11/22/2005 & 6:29 AM|
|                      8/8/2002 & 6:51 AM|
|                     8/12/1980 & 9:01 AM|
|                    10/26/1997 & 3:19 PM|
|                     12/1/1980 & 1:08 AM|
|                    1/27/2008 & 11:40 PM|
|                     1/14/1999 & 7:13 AM|
|                      6/5/2016 & 6:09 AM|
|                     9/21/2010 & 5:56 AM|
|                     12/7/1986 & 7:45 PM|
|                    10/23/1981 & 10:2...|
|                     7/22/2010 & 3:48 AM|
+----------------------------------------+
only showing top 20 rows

In [115]:
#to rename
df15 = df5.select(concat("Start Date",lit(" & "),"Last Login Time").alias("datetime")).show()
#to get entire dataframe
df5.select("*",concat("Start Date",lit(" & "),"Last Login Time").alias("datetime")).show()

+--------------------+
|            datetime|
+--------------------+
| 8/6/1993 & 12:42 PM|
| 3/31/1996 & 6:53 AM|
|4/23/1993 & 11:17 AM|
|  3/4/2005 & 1:00 PM|
| 1/24/1998 & 4:47 PM|
| 4/18/1987 & 1:35 AM|
| 8/17/1987 & 4:20 PM|
|7/20/2015 & 10:43 AM|
|11/22/2005 & 6:29 AM|
|  8/8/2002 & 6:51 AM|
| 8/12/1980 & 9:01 AM|
|10/26/1997 & 3:19 PM|
| 12/1/1980 & 1:08 AM|
|1/27/2008 & 11:40 PM|
| 1/14/1999 & 7:13 AM|
|  6/5/2016 & 6:09 AM|
| 9/21/2010 & 5:56 AM|
| 12/7/1986 & 7:45 PM|
|10/23/1981 & 10:2...|
| 7/22/2010 & 3:48 AM|
+--------------------+
only showing top 20 rows

+----------+------+----------+---------------+------+-------+-----------------+--------------------+--------------------+
|First Name|Gender|Start Date|Last Login Time|Salary|Bonus %|Senior Management|                Team|            datetime|
+----------+------+----------+---------------+------+-------+-----------------+--------------------+--------------------+
|   Douglas|  Male|  8/6/1993|       12:42 PM| 97308|  6.945|             true|           Marketing| 8/6/1993 & 12:42 PM|
|    Thomas|  Male| 3/31/1996|        6:53 AM| 61933|   4.17|             true|                null| 3/31/1996 & 6:53 AM|
|     Maria|Female| 4/23/1993|       11:17 AM|130590| 11.858|            false|             Finance|4/23/1993 & 11:17 AM|
|     Jerry|  Male|  3/4/2005|        1:00 PM|138705|   9.34|             true|             Finance|  3/4/2005 & 1:00 PM|
|     Larry|  Male| 1/24/1998|        4:47 PM|101004|  1.389|             true|     Client Services| 1/24/1998 & 4:47 PM|
|    Dennis|  Male| 4/18/1987|        1:35 AM|115163| 10.125|            false|               Legal| 4/18/1987 & 1:35 AM|
|      Ruby|Female| 8/17/1987|        4:20 PM| 65476| 10.012|             true|             Product| 8/17/1987 & 4:20 PM|
|      null|Female| 7/20/2015|       10:43 AM| 45906| 11.598|             null|             Finance|7/20/2015 & 10:43 AM|
|    Angela|Female|11/22/2005|        6:29 AM| 95570| 18.523|             true|         Engineering|11/22/2005 & 6:29 AM|
|   Frances|Female|  8/8/2002|        6:51 AM|139852|  7.524|             true|Business Development|  8/8/2002 & 6:51 AM|
|    Louise|Female| 8/12/1980|        9:01 AM| 63241| 15.132|             true|                null| 8/12/1980 & 9:01 AM|
|     Julie|Female|10/26/1997|        3:19 PM|102508| 12.637|             true|               Legal|10/26/1997 & 3:19 PM|
|   Brandon|  Male| 12/1/1980|        1:08 AM|112807| 17.492|             true|     Human Resources| 12/1/1980 & 1:08 AM|
|      Gary|  Male| 1/27/2008|       11:40 PM|109831|  5.831|            false|               Sales|1/27/2008 & 11:40 PM|
|  Kimberly|Female| 1/14/1999|        7:13 AM| 41426| 14.543|             true|             Finance| 1/14/1999 & 7:13 AM|
|   Lillian|Female|  6/5/2016|        6:09 AM| 59414|  1.256|            false|             Product|  6/5/2016 & 6:09 AM|
|    Jeremy|  Male| 9/21/2010|        5:56 AM| 90370|  7.369|            false|     Human Resources| 9/21/2010 & 5:56 AM|
|     Shawn|  Male| 12/7/1986|        7:45 PM|111737|  6.414|            false|             Product| 12/7/1986 & 7:45 PM|
|     Diana|Female|10/23/1981|       10:27 AM|132940| 19.082|            false|     Client Services|10/23/1981 & 10:2...|
|     Donna|Female| 7/22/2010|        3:48 AM| 81014|  1.894|            false|             Product| 7/22/2010 & 3:48 AM|
+----------+------+----------+---------------+------+-------+-----------------+--------------------+--------------------+
only showing top 20 rows

In [119]:
dffinal = df5.drop("Start Date","Last Login Time")

In [120]:
dffinal.show()

+----------+------+------+-------+-----------------+--------------------+
|First Name|Gender|Salary|Bonus %|Senior Management|                Team|
+----------+------+------+-------+-----------------+--------------------+
|   Douglas|  Male| 97308|  6.945|             true|           Marketing|
|    Thomas|  Male| 61933|   4.17|             true|                null|
|     Maria|Female|130590| 11.858|            false|             Finance|
|     Jerry|  Male|138705|   9.34|             true|             Finance|
|     Larry|  Male|101004|  1.389|             true|     Client Services|
|    Dennis|  Male|115163| 10.125|            false|               Legal|
|      Ruby|Female| 65476| 10.012|             true|             Product|
|      null|Female| 45906| 11.598|             null|             Finance|
|    Angela|Female| 95570| 18.523|             true|         Engineering|
|   Frances|Female|139852|  7.524|             true|Business Development|
|    Louise|Female| 63241| 15.132|             true|                null|
|     Julie|Female|102508| 12.637|             true|               Legal|
|   Brandon|  Male|112807| 17.492|             true|     Human Resources|
|      Gary|  Male|109831|  5.831|            false|               Sales|
|  Kimberly|Female| 41426| 14.543|             true|             Finance|
|   Lillian|Female| 59414|  1.256|            false|             Product|
|    Jeremy|  Male| 90370|  7.369|            false|     Human Resources|
|     Shawn|  Male|111737|  6.414|            false|             Product|
|     Diana|Female|132940| 19.082|            false|     Client Services|
|     Donna|Female| 81014|  1.894|            false|             Product|
+----------+------+------+-------+-----------------+--------------------+
only showing top 20 rows

In [122]:
dffinal.write.csv("/home/labuser/day3/Pysparkfinal_employee.csv")